// 1
// это обычный объект в виде строки

// 2
// синтаксис легко преобразовать в объекты JS
// и мы использукм его для обмена данных
// 3

// let a = '{"name": "Alex", "age": 24}'
// console.log(a);

// 4
// let obj = {name: "Alex", age: 24};
// let stroka = JSON.stringify(obj); 
// console.log(stroka);

// 5
// let objJsn = '{"name": "Alex", "age": 24}'
// let objJs =  JSON.parse(objJsn)

// 6
// строка,число,объект,массив,логическое,null

// 7
// функция,даты,undefined

// 8
// Получаем в виде JSON

// 9
// Собрать данные в JSON-формат.
// Упаковать их в специальный запрос.
// Встроенными средствами JavaScript отправить этот запрос на сервер по нужному адресу.